NativoPlusStudio.AuthToken.FisTests/GetCallChexSystemsServiceV001.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:fischex">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:callChexSystemsServiceV001>
         <in0>{{AuthToken}}</in0>
         <in1>
            <acquirerid>{{AcquirerId}}</acquirerid>
            <chexsystemsversionnbr>{{ChexsyStemsVersion}}</chexsystemsversionnbr>
            <customerid>{{CustomerId}}</customerid>
            <includechexsystems>{{IncludeChexSystems}}</includechexsystems>
            <includeidentitymanager>{{IncludeIdentityManager}}</includeidentitymanager>
            <includeofac>{{IncludeOfac}}</includeofac>
            <includequalifile>{{IncludeQualifile}}</includequalifile>
            <inquiryid>{{InquiryId}}</inquiryid>
            <locationid>{{LocationId}}</locationid>
            <qualifileversionnbr>{{QualifileVersion}}</qualifileversionnbr>
            <staging>{{Staging}}</staging>
            <strategytypeid>{{StrategyTypeId}}</strategytypeid>
            <userdefinedtransactiontxt>{{UserDefinedTransaction}}</userdefinedtransactiontxt>
            <reportdatatype>2</reportdatatype> 
         </in1>
         <in2>
            <birthdt>{{BirthDate}}</birthdt>
            <citynm>{{Citynm}}</citynm>
            <compositephonenbr>{{CompositePhoneNumber}}</compositephonenbr>
            <countrynm>{{Country}}</countrynm>
            <firstnm>{{FirstName}}</firstnm>
            <governmentnbr>{{GovernmentNumber}}</governmentnbr>
            <identificationstatecd>{{IdentificationState}}</identificationstatecd>
            <identificationstatenbr>{{IdentificationStateNumber}}</identificationstatenbr>
            <lastnm>{{LastName}}</lastnm>
            <middlenm>{{MiddleName}}</middlenm>
            <postalplusfourcd>{{PostalPlusFour}}</postalplusfourcd>
            <statecd>{{State}}</statecd>
            <streetaddresstxt>{{StreetAddress}}</streetaddresstxt>
            <depositAmt>{{DepositAmt}}</depositAmt>
            <prevAddressMonthsNbr>{{PrevAddressMonthsNbr}}</prevAddressMonthsNbr>
            <prevAddressYearsNbr>{{PrevAddressYearsNbr}}</prevAddressYearsNbr>
            <prevCityNm>{{PrevCityNm}}</prevCityNm>
            <prevCountryCd>{{PrevCountryCd}}</prevCountryCd>
            <prevPostalPlusFourCd>{{PrevPostalPlusFourCd}}</prevPostalPlusFourCd>
            <prevStateCd>{{PrevStateCd}}</prevStateCd>
            <prevStreetAddressTxt>{{PrevStreetAddress}}</prevStreetAddressTxt>
            <userdefinedrecordtxt>{{UserDefinedRecord}}</userdefinedrecordtxt>
         </in2>
      </urn:callChexSystemsServiceV001>
   </soapenv:Body>
</soapenv:Envelope>